let glossaryItemsRu = [
    {
        name: ["Алгоритм", "алгоритм"],
        definition: 'Конечная последовательность точных действий, формальное выполнение которых позволяет получить решение задачи для любого допустимого набора исходных данных.'
    },
    {
        name: ['Алгоритмы', "алгоритмы", "алгоритмов", "алгоритмами"],
        definition: 'Понятные и конечные последовательности точных действий (команд), формальное выполнение которых позволяет получить решение поставленной задачи.'
    },

    {
        name: ["Алгоритмическая конструкция ветвление", 'ветвление'],
        definition: 'Обеспечивает выполнение одной или другой последовательности команд в зависимости от истинности или ложности некоторого условия'
    },

    {
        name: ["Алгоритмическая конструкция повторение", "повторение", 'цикл', ],
        definition: 'Представляет собой последовательность действий, выполняемых многократно.'
    },
    {
        name: ['Анимация', 'анимация'],
        definition: 'Процесс изменения размера, положения, цвета или формы объекта с течением времени.'
    },
    {
        name: ['анимация движения', "анимации движения"],
        definition: 'Анимация, в которой достаточно задать состояние объекта в начале и в конце движения, а все промежуточные фазы движения рассчитает программа.'
    },
    {
        name: ["Аудиоинформация", "звукозапись"],
        definition: 'Звуковая информация, записанная каким-либо образом, пригодным для воспроизведения.'
    },

    {
        name: ['Аудиоредактор', 'аудиоредактор', ],
        definition: 'Программное средство, которое используется для редактирования аудиофайлов.'
    },
    {
        name: ['Базовые алгоритмические конструкции'],
        definition: 'Следование, цикл и ветвление.'
    },
    {
        name: ['Битрейт', 'битрейт', "битрейта"],
        definition: 'Количество бит двоичной записи, которое приходится на секунду воспроизведения (скорость потока).'
    },
    {
        name: ['Видеоконвертер', 'видеоконвертер'],
        definition: 'Программное средство для конвертации видеофайлов.'
    },
    {
        name: ['Видеопереход между клипами', 'видеопереход между клипами', 'видеопереход', 'видеопереходы'],
        definition: 'Эффект смены, который можно вставлять между клипами.'
    },
    {
        name: ['Видеоредактор', 'видеоредактор', ],
        definition: 'Программное средство для видеомонтажа.'
    },
    {
        name: ['Видеоряд', 'видеоряд'],
        definition: 'Полоса из условных изображений видеофрагментов, которая отражает структуру видеофильма.'
    },
    {
        name: ['Вспомогательный алгоритм', "вспомогательный алгоритм"],
        definition: 'Алгоритм, который можно использовать в других алгоритмах, указав его имя и, если необходимо, значения параметров.'
    },
    {
        name: ["Высказывание", 'высказывание'],
        definition: 'Повествовательное предложение (утверждение), о котором можно сказать, истинно оно или ложно.'
    },

    {
        name: ['Исполнитель', 'исполнитель'],
        definition: 'Наука, изучающая методы представления, хранения, передачи, обработки и использования информации с применением компьютерных технологий в различных сферах человеческой деятельности.'
    },
    {
        name: ['Кадры', 'кадры', "кадр", ],
        definition: 'Изображения последовательных фаз движения объектов или их частей.'
    },
    {
        name: ['Клип', 'клип', "клипа"],
        definition: 'Видеофрагмент.'
    },
    {
        name: ['Ключевые кадры', 'ключевые кадры'],
        definition: 'Кадры, содержимое которых определяется автором анимации.'
    },
    {
        name: ['Кодеке', 'кодек'],
        definition: 'Специальная программа, которая сжимает (уменьшает) и восстанавливает первоначальный объем аудио- или видеофайла.'
    },
    {
        name: ['Колонтитул', 'колонтитул'],
        definition: 'Текст или изображение, которые размещаются на краю каждой страницы документа и повторяются на всех страницах.'
    },

    {
        name: ['Компьютерный видеомонтаж', 'компьютерный видеомонтаж', "видеомонтаж"],
        definition: 'Процесс создания видеофильма из видеофрагментов с помощью специального программного средства.'
    },
    {
        name: ['Конвертация ', 'конвертация ', ],
        definition: 'Процесс изменения его формата.'
    },
    {
        name: ['Логические операции', 'логические операции'],
        definition: 'НЕ, И, ИЛИ, в PascalABC not, and, or (соответственно).'
    },
    {
        name: ['логический тип данных', 'boolean'],
        definition: 'Тип данных, предназначенный для работы с условиями. Величины типа boolean могут принимать два значения — false (ложь) и true (истина).'
    },
    {
        name: ['логическое выражение', 'Логическое выражение'],
        definition: 'Выражение, принимающее одно из двух значений: true или false.'
    },
    {
        name: ['Маркированный список', 'маркированный список'],
        definition: 'Список абзацев, отмеченных маркерами.'
    },
    {
        name: ['Медиаплеер', 'медиаплеер', "медиаплеера"],
        definition: 'Плеер, который воспроизводит как звук, так и видео.'
    },
    {
        name: ['Многоуровневый список', 'многоуровневый список'],
        definition: 'Список абзацев, в которых применяются одновременно различные виды номеров и/или маркеров.'
    },
    {
        name: ['Направляющий слой', 'направляющий слой', ],
        definition: 'Слой, содержащий траекторию движения.'
    },
    {
        name: ['Нумерованный список', 'нумерованный список', ],
        definition: 'Список абзацев, отмеченных номерами.'
    },
    {
        name: ["Оглавление", "оглавление"],
        definition: 'Указатель заголовков в документе, отражающий его структуру и ускоряющий поиск частей произведения по номерам страниц.'
    },

    {
        name: ['Оператор ветвления', 'оператор ветвления'],
        definition: 'Команда, реализующая алгоритмическую конструкцию ветвление на языке программирования.'
    },
    {
        name: ['Оператор присваивания', "оператор присваивания"],
        definition: 'Предназначен для того, чтобы задавать значения переменным и вычислять значение выражений.'
    },

    {
        name: ['Оператор цикла', 'оператор цикла'],
        definition: 'Команда, реализующая алгоритмическую конструкцию повторение на языке программирования.'
    },
    {
        name: ['Плеер', 'плеер'],
        definition: 'Программа для воспроизведения аудио- и видеофайлов.'
    },
    {
        name: ['Программа', 'программа'],
        definition: 'Последовательность команд, исполнителем которой является компьютер. Представляет собой запись на некотором формальном языке — языке программирования.'
    },
    {
        name: ['Публикация', 'публикация', ],
        definition: 'Сохранение фильма в формате SWF.'
    },
    {
        name: ['Система проверки правописания', 'система проверки правописания'],
        definition: 'Компьютерная программа, осуществляющая проверку заданного текста на наличие в нем орфографических ошибок.'
    },
    {
        name: ['Следование', 'следование'],
        definition: 'Последовательность команд алгоритма, которые выполняются в том порядке, в котором они записаны. Среди команд, образующих алгоритмическую конструкцию следование, отсутствуют команды, меняющие порядок выполнения других команд.'
    },
    {
        name: ['Составное условие', 'составное условие'],
        definition: 'Логическое выражение, в котором наряду с простыми условиями (сравнениями) используются логические операции.'
    },
    {
        name: ['Список', "список"],
        definition: 'Абзацы, отмеченные маркерами или номерами.'
    },
    {
        name: ['Стиль', 'стиль'],
        definition: 'Набор параметров форматирования текста.'
    },
    {
        name: ['Текстовый клип', "текстовый клип"],
        definition: 'Видеофрагмент с текстовой надписью на прозрачном или цветном фоне.'
    },
    {
        name: ['Фильм', 'фильм'],
        definition: 'Документ, созданный в Flash.'
    },
    {
        name: ['Цикл с параметром', 'цикл с параметром'],
        definition: 'Используется тогда, когда известно количество повторений.'
    },
    {
        name: ['Цикл с предусловием', 'цикл с предусловием'],
        definition: 'Используется в том случае, когда известно условие продолжения работы.'
    },
    {
        name: ['Экземпляр', 'экземпляр'],
        definition: 'Копия символа, помещенная в рабочую область.'
    }


]

//бел версия
let glossaryItemsBel = [
    {
        name: ["абзацаў", "абзацамі", 'Абзац', 'абзац', 'Абзацы', 'абзацы', "абзацам", 'абзаца', ],
        definition: 'Тэкст, які заканчваецца знакам абзаца: ¶.'
    },
    {
        name: ['Алгарытмы', 'алгарытмы', "алгарытмаў", "алгарытмамі"],
        definition: 'Зразумелыя і канечныя паслядоўнасцi дакладных дзеянняў (каманд), фармальнае выкананне якіх дазваляе атрымаць рашэнне пастаўленай задачы.'
    },
    {
        name: ['Алгарытм', 'алгарытм', "алгарытме", "алгарытму"],
        definition: 'Зразумелая і канечная паслядоўнасць дакладных дзеянняў (каманд), фармальнае выкананне якіх дазваляе атрымаць рашэнне пастаўленай задачы.'
    },

    {
        name: ['Браўзер', 'браўзер', "браўзера"],
        definition: 'Праграма, прызначаная для прагляду вэб-старонак.'
    },
    {
        name: ['Браўзеры', 'браўзеры', "браўзераў"],
        definition: 'Праграмы, прызначаныя для прагляду вэб-старонак.'
    },
    {
        name: ['Буфер абмену', 'буфер абмену', "буфера абмену", "буферам абмену"],
        definition: 'Спецыяльная вобласць памяці камп’ютара для часовага захоўвання даных пры выкананні аперацый Вырезать і Копировать.'
    },
    {
        name: ['Вэб-сайт', 'вэб-сайт', "вэб-сайта"],
        definition: 'Некалькі вэб-старонак з агульнай тэмай і зместам, звязаныя паміж сабой гіперспасылкамі.'
    },
    {
        name: ['Вэб-сайты', 'вэб-сайты'],
        definition: 'Некалькі вэб-старонак з агульнай тэмай і зместам, звязаныя паміж сабой гіперспасылкамі.'
    },
    {
        name: ['Вэб-старонка', 'вэб-старонка', "вэб-старонку"],
        definition: 'Дакумент або інфармацыйны рэсурс Інтэрнэту.'
    },
    {
        name: ['Вэб-старонкі', 'вэб-старонкі'],
        definition: 'Дакументы або інфармацыйныя рэсурсы Інтэрнэту.'
    },
    {
        name: ['Дапаможны алгарытм', 'дапаможны алгарытм', "дапаможнага алгарытму", "дапаможным алгарытме"],
        definition: 'Алгарытм, які можна цалкам выкарыстоўваць у іншых алгарытмах.'
    },
    {
        name: ['Дапаможныя алгарытмы', 'дапаможныя алгарытмы'],
        definition: 'Алгарытмы, якія можна цалкам выкарыстоўваць у іншых алгарытмах.'
    },
    {
        name: ['Графічны рэдактар', 'графічны рэдактар', "графічнага рэдактара", "графічным рэдактары", "графічным рэдактарах"],
        definition: 'Спецыяльная праграма, прызначаная для стварэння і рэдагавання відарысаў.'
    },
    {
        name: ['Графічныя рэдактары', 'графічныя рэдактары', "графічных рэдактарах"],
        definition: 'Спецыяльныя праграмы, прызначаныя для стварэння і рэдагавання відарысаў.'
    },
    {
        name: ['Графічны спосаб запісу алгарытму', 'графічны спосаб запісу алгарытму', "графічнага спосабу запісу алгарытму"],
        definition: 'Запіс алгарытму з дапамогай геаметрычных фігур (блокаў), якія адпавядаюць камандам алгарытму, і ліній для злучэння блокаў.'
    },
    {
        name: ['Даныя', 'даныя', "даных"],
        definition: 'Звесткі, прыведзеныя ў фармалізаваным выглядзе (на адной з фармальных моў).'
    },
    {
        name: ['Інтэрнэт', "Інтэрнэце", 'інтэрнэт'],
        definition: 'Сусветная камп’ютарная сетка, здольная перадаваць даныя з аднаго пункта зямнога шара ў любы іншы.'
    },
    {
        name: ['Інфарматыка', 'інфарматыка'],
        definition: 'Навука, якая вывучае метады ўяўлення, захоўвання, перадачы, апрацоўкі і выкарыстання інфармацыі з ужываннем камп’ютарных тэхналогій у розных сферах чалавечай дзейнасці.'
    },
    {
        name: ['Інфармацыя', 'інфармацыя', "інфармацыі", "інфармацыяй", "інфармацыю"],
        definition: 'Звесткі пра аб’екты і з’явы навакольнага свету.'
    },
    {
        name: ['Выканаўца алгарытму', 'выканаўца алгарытму', 'выканаўцам алгарытмаў', "выканаўца", "выканаўцы", "выканаўцам"],
        definition: 'Чалавек, група людзей або тэхнічнае ўстройства, якія разумеюць каманды алгарытму і ўмеюць правільна іх выконваць.'
    },
    {
        name: ['Выканаўцы алгарытмаў', 'выканаўцы алгарытмаў'],
        definition: 'Група людзей або тэхнічныя ўстройствы, якія разумеюць каманды алгарытмаў і ўмеюць правільна іх выконваць.'
    },
    {
        name: ['Каманда ў алгарытме', 'каманда ў алгарытме'],
        definition: 'Накіраванне на выкананне канкрэтнага дзеяння.'
    },
    {
        name: ['Каманды ў алгарытме', 'каманды ў алгарытме'],
        definition: 'Накіраванні на выкананне канкрэтнага дзеяння.'
    },

    {
        name: ['Камп’ютарная прэзентацыя', 'камп’ютарная прэзентацыя', 'камп’ютарнай прэзентацыі', ],
        definition: 'Электронны дакумент, створаны на камп’ютары з дапамогай спецыяльных праграм і прызначаны для дэманстрацыі гледачам.'
    },
    {
        name: ['Камп’ютарныя прэзентацыі', 'камп’ютарныя прэзентацыі', ],
        definition: 'Электронныя дакументы, створаныя на камп’ютары з дапамогай спецыяльных праграм і прызначаныя для дэманстрацыі гледачам.'
    },
    {
        name: ['Камп’ютарныя тэхналогіі', 'камп’ютарныя тэхналогіі'],
        definition: 'Тэхналогіі работы з данымі, заснаваныя на выкарыстанні камп’ютараў.'
    },
    {
        name: ['Адбіццё відарыса', 'адбіццё відарыса', "адлюстраванне", "адлюстравання"],
        definition: 'Люстраное адлюстраванне відарыса адносна нябачнай восі (гарызантальнай або вертыкальнай).'
    },
    {
        name: ['Прэзентацыя', 'прэзентацыя', "прэзентацыі", "прэзентацыяй", "прэзентацыяю"],
        definition: 'Спосаб уяўлення інфармацыі з дапамогай тэхнічных сродкаў або без іх, прызначаны для дэманстрацыі чаго-небудзь новага (праекта, тавару і г. д.).'
    },
    {
        name: ['Прэзентацыі', 'прэзентацыі', "прэзентацый"],
        definition: 'Спосабы уяўлення інфармацыі з дапамогай тэхнічных сродкаў або без іх, прызначаныя для дэманстрацыі чаго-небудзь новага (праекта, тавару і г. д.).'
    },
    {
        name: ['Праграмнае забеспячэнне (ПЗ)', 'праграмнае забеспячэнне', "праграмнага забеспячэння"],
        definition: 'Сукупнасць усіх праграм, напісаных чалавекам для камп’ютара.'
    },
    {
        name: ['Праграмны спосаб запісу алгарытму', 'праграмны спосаб запісу алгарытму'],
        definition: 'Запіс алгарытму ў выглядзе праграмы.'
    },
    {
        name: ['Рэдагаванне', 'рэдагаванне', "рэдагавання", "рэдагаванні"],
        definition: 'Змяненне відарыса або зместу тэксту.'
    },
    {
        name: ['Сімвалы тэксту', 'сімвалы тэксту'],
        definition: 'Кожная літара, лічба, знак прыпынку і г. д.'
    },
    {
        name: ["сімвалам", "сімвала", "сімвалаў", 'Сімвал тэксту', 'сімвал тэксту', "сімвал", ],
        definition: 'Кожная літара, лічба, знак прыпынку і г. д.'
    },

    {
        name: ['Слайды', 'слайды', "слайдаў", "слайдамі"],
        definition: 'Асобныя старонкі прэзентацыі, прызначаныя для змяшчэння матэрыялаў.'
    },
    {
        name: ['Слайд', "слайда", 'слайд', "слайдзе", ],
        definition: 'Асобная старонка прэзентацыі, прызначаная для змяшчэння матэрыялаў.'
    },
    {
        name: ['Слоўны спосаб запісу алгарытму', 'слоўны спосаб запісу алгарытму'],
        definition: 'Запіс алгарытму на натуральнай мове зносін.'
    },
    {
        name: ['Тэкставы дакумент', 'тэкставы дакумент', "тэкставага дакумента", "тэкставым дакуменце"],
        definition: 'Дакумент, інфармацыя ў якім пададзена ў выглядзе тэксту.'
    },
    {
        name: ['Тэкставыя дакументы', 'тэкставыя дакументы'],
        definition: 'Дакументы, інфармацыя ў якіх пададзена ў выглядзе тэксту.'
    },
    {
        name: ['Тэкставы курсор', 'тэкставы курсор', "курсор", "курсорам"],
        definition: 'Паказальнік месца ўводу сімвала.'
    },
    {
        name: ['Тэкставы рэдактар', 'тэкставы рэдактар', "тэкставым рэдактарам", "тэкставага рэдактара"],
        definition: 'Праграма, прызначаная для работы са змесцівам электронных тэкставых дакументаў.'
    },
    {
        name: ['Тэкставыя рэдактары', 'тэкставыя рэдактары', "тэкставых рэдактараў"],
        definition: 'Праграмы, прызначаныя для работы са змесцівам электронных тэкставых дакументаў.'
    },
    {
        name: ['Фармаціраванне тэксту', 'фармаціраванне тэксту'],
        definition: 'Змяненне формы ўяўлення тэксту.'
    },
    {
        name: ['Фрагмент відарыса', 'фрагмент відарыса', "фрагмента відарыса", "фрагментам відарыса"],
        definition: 'Вылучаная частка відарыса.'
    },
    {
        name: ['Фрагменты відарыса', 'фрагменты відарыса'],
        definition: 'Вылучаныя часткі відарыса.'
    },
    {
        name: ['Фрагмент тэксту', 'фрагмент тэксту'],
        definition: 'Вылучаная частка камп’ютарнага тэксту.'
    },
    {
        name: ['Фрагменты тэксту', 'фрагменты тэксту'],
        definition: 'Вылучаныя часткі камп’ютарнага тэксту.'
    },
    {
        name: ['Электронная пошта', 'электронная пошта', 'электроннай пошце', "электроннай пошты", "электроннай поштай"],
        definition: 'Служба сеткі Інтэрнэт, прызначаная для абмену паведамленнямі (электроннымі лістамі) з дапамогай электронных паштовых скрынь.'
    },
    {
        name: ['Электронны тэкставы дакумент', 'электронны тэкставы дакумент', "электроннага тэкставага дакумента"],
        definition: 'Тэкставы дакумент, захаваны на дыску ў файле. '
    },
    {
        name: ['Электронныя тэкставыя дакументы', 'электронныя тэкставыя дакументы'],
        definition: 'Тэкставыя дакументы, захаваныя на дыску ў файле.'
    },
    {
        name: ['Камп’ютары', 'камп’ютары'],
        definition: 'Універсальныя ўстройствы для работы з данымі.'
    },
    {
        name: ["камп’ютара", 'Камп’ютар', 'камп’ютар', "камп’ютарам", "камп’ютараў"],
        definition: 'Універсальнае ўстройства для работы з данымі.'
    },

]

function addLink(arr) {
    let words = [...arr]

    $($('.main')[0].children).each((ind, item) => {
        $($(item)[0].children).each((i, elem) => {
            if (!elem.matches('.not-linked')) {
                words.forEach(word => {
                    word.name.forEach(item => {
                        let regexp = new RegExp(" " + item + "[\\s,]", 'i')

                        if (regexp.exec(elem.innerHTML)) {
                            result = regexp.exec(elem.innerHTML)
                            let elName = elem.name ? (elem.name.split('-')[0]) : null


                            if (elem.className !== 'bordered' && elem.className !== 'noparset' && !elem.matches('.glossary-word') && !elem.matches('.about') && elName !== 'to' && elem.tagName !== 'H4' && elem.tagName !== 'H1' && elem.tagName !== 'H5' && elem.tagName !== 'B') {
                                var reg = new RegExp(item, 'g');

                                elem.innerHTML = elem.innerHTML.replace(reg, '<span style="color: gray;" class = "glossary-word">' + item + '</span>');
                            }



                        }
                    })

                })
            }
        })


    })

}
